system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0     0  -100)
    (100     0  -100)
    (100  10000  -100)
    ( 0  10000  -100)
    ( 0     0   100)
    (100     0   100)
    (100  10000   100)
    ( 0  10000   100)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 400 10) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type patch;
        faces
        (
			(2 3 7 6)
        );
    }
	
	bottom
	{
		type patch;
		faces
		(
		    (0 1 5 4)
		);
	}

    symmetry1
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
	
    symmetry2
    {
        type symmetry;
        faces
        (
            (3 2 1 0)
        );
    }

    hot
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    cold
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

// ************************************************************************* //
