0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    symmetry1
    {
        type            symmetry;
    }
	
    symmetry2
    {
        type            symmetry;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
	bottom
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    hot
    {
        type            noSlip;
    }

    cold
    {
        type            noSlip;
    }
}


// ************************************************************************* //
