0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    #includeEtc "caseDicts/setConstraintTypes"

    symmetry1
    {
        type            symmetry;
    }
	
    symmetry2
    {
        type            symmetry;
    }


    top
    {
        type            prghTotalPressure;
        p0              $internalField;
        value           $internalField;
    }
	bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }	

    hot
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    cold
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
