0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-04;


boundaryField
{
    symmetry1
    {
        type            symmetry;
    }
	
    symmetry2
    {
        type            symmetry;
    }

    top
    {
        type            zeroGradient;
    }
	bottom
    {
        type            fixedValue;
        value           $internalField;
    }	
    hot
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    cold
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
